import Cards from "../components/Cards";
import FirstBlockOptions from "../components/FirstBlockOptions";
import Free from "../components/Free";
import HowWork from "../components/HowWork";
import { Tabs, Tab } from "react-bootstrap";
import { Table, Accordion } from 'react-bootstrap'
import CustomLi from '../components/CustomLi'
import { useParams } from "react-router-dom";

const doma = [
    {
        id: '1',
        title: 'Проект дома ДБ023',
        floor: '1',
        sizes: '8x7 м',
        square: '55.4 кв.м',
        balkon: 'нет',
        terrace: 'нет',
        krylco: 'есть',
        erker: 'нет',
        sanuzel: '1',
        bedroom: '2',
        roof: 'прямая',
        kukushka: 'нет',
        twoDoor: 'нет',
        garage: 'нет',
        topochnaya: 'есть',
        previewImg1: require('../images/Projects/db023/db023_01.webp'),
        previewImg2: require('../images/Projects/db023/db023_02.webp'),
        planImg1: require('../images/Projects/db023/db023_11.webp'),
        previewImg31: require('../images/Projects/db023/db023_31.webp'),
        previewImg32: require('../images/Projects/db023/db023_32.webp'),
        previewImg33: require('../images/Projects/db023/db023_33.webp'),
        previewImg34: require('../images/Projects/db023/db023_34.webp'),
    },
    {
        id: '2',
        title: 'Проект дома ДБ024',
        floor: '1+М',
        sizes: '8x7 м',
        square: '84.2 кв.м',
        balkon: 'нет',
        terrace: 'есть',
        krylco: 'нет',
        erker: 'нет',
        sanuzel: '1',
        bedroom: '4',
        roof: 'прямая',
        kukushka: 'нет',
        twoDoor: 'нет',
        garage: 'нет',
        topochnaya: 'нет',
        previewImg1: require('../images/Projects/db024/db024_01.webp'),
        previewImg2: require('../images/Projects/db024/db024_02.webp'),
        planImg1: require('../images/Projects/db024/db024_11.webp'),
        planImg2: require('../images/Projects/db024/db024_12.webp'),
        previewImg31: require('../images/Projects/db024/db024_31.webp'),
        previewImg32: require('../images/Projects/db024/db024_32.webp'),
        previewImg33: require('../images/Projects/db024/db024_33.webp'),
        previewImg34: require('../images/Projects/db024/db024_34.webp'),
    },
    {
        id: '3',
        title: 'Проект дома ДБ037',
        floor: '1+М',
        sizes: '9x6 м',
        square: '86.5 кв.м',
        balkon: 'нет',
        terrace: 'есть',
        krylco: 'нет',
        erker: 'нет',
        sanuzel: '1',
        bedroom: '4',
        roof: 'прямая',
        kukushka: 'нет',
        twoDoor: 'нет',
        garage: 'нет',
        topochnaya: 'нет',
        previewImg1: require('../images/Projects/db037/db037_01.webp'),
        previewImg2: require('../images/Projects/db037/db037_02.webp'),
        planImg1: require('../images/Projects/db037/db037_11.webp'),
        planImg2: require('../images/Projects/db037/db037_12.webp'),
        previewImg31: require('../images/Projects/db037/db037_31.webp'),
        previewImg32: require('../images/Projects/db037/db037_32.webp'),
        previewImg33: require('../images/Projects/db037/db037_33.webp'),
        previewImg34: require('../images/Projects/db037/db037_34.webp'),
    },
    {
        id: '4',
        title: 'Проект дома ДБ058',
        floor: '1+М',
        sizes: '8.5x7 м',
        square: '92.7 кв.м',
        balkon: 'нет',
        terrace: 'есть',
        krylco: 'нет',
        erker: 'нет',
        sanuzel: '1',
        bedroom: '4',
        roof: 'прямая',
        kukushka: 'нет',
        twoDoor: 'нет',
        garage: 'нет',
        topochnaya: 'нет',
        previewImg1: require('../images/Projects/db058/db058_01.webp'),
        previewImg2: require('../images/Projects/db058/db058_02.webp'),
        planImg1: require('../images/Projects/db058/db058_11.webp'),
        planImg2: require('../images/Projects/db058/db058_12.webp'),
        previewImg31: require('../images/Projects/db058/db058_31.webp'),
        previewImg32: require('../images/Projects/db058/db058_32.webp'),
        previewImg33: require('../images/Projects/db058/db058_33.webp'),
        previewImg34: require('../images/Projects/db058/db058_34.webp'),
    },
    {
        id: '5',
        title: 'Проект дома ДБ066',
        floor: '1.5',
        sizes: '8x8 м',
        square: '112 кв.м',
        balkon: 'есть',
        terrace: 'есть',
        krylco: 'нет',
        erker: 'нет',
        sanuzel: '2',
        bedroom: '4',
        roof: 'прямая',
        kukushka: 'нет',
        twoDoor: 'нет',
        garage: 'нет',
        topochnaya: 'нет',
        previewImg1: require('../images/Projects/db066/db066_01.webp'),
        previewImg2: require('../images/Projects/db066/db066_02.webp'),
        planImg1: require('../images/Projects/db066/db066_11.webp'),
        planImg2: require('../images/Projects/db066/db066_12.webp'),
        previewImg31: require('../images/Projects/db066/db066_31.webp'),
        previewImg32: require('../images/Projects/db066/db066_32.webp'),
        previewImg33: require('../images/Projects/db066/db066_33.webp'),
        previewImg34: require('../images/Projects/db066/db066_34.webp'),
    },
    {
        id: '6',
        title: 'Проект дома ДБ073',
        floor: '1.5',
        sizes: '7x6 м',
        square: '70.3 кв.м',
        balkon: 'есть',
        terrace: 'есть',
        krylco: 'нет',
        erker: 'нет',
        sanuzel: '1',
        bedroom: '3',
        roof: 'прямая',
        kukushka: 'нет',
        twoDoor: 'нет',
        garage: 'нет',
        topochnaya: 'нет',
        previewImg1: require('../images/Projects/db073/db073_01.webp'),
        previewImg2: require('../images/Projects/db073/db073_02.webp'),
        planImg1: require('../images/Projects/db073/db073_11.webp'),
        planImg2: require('../images/Projects/db073/db073_12.webp'),
        previewImg31: require('../images/Projects/db073/db073_31.webp'),
        previewImg32: require('../images/Projects/db073/db073_32.webp'),
        previewImg33: require('../images/Projects/db073/db073_33.webp'),
        previewImg34: require('../images/Projects/db073/db073_34.webp'),
    },
    {
        id: '7',
        title: 'Проект дома ДБ127',
        floor: '2',
        sizes: '',
        square: '71.9 кв.м',
        balkon: 'нет',
        terrace: 'нет',
        krylco: 'есть',
        erker: 'нет',
        sanuzel: '1',
        bedroom: '2',
        roof: 'прямая',
        kukushka: 'нет',
        twoDoor: 'нет',
        garage: '',
        topochnaya: 'нет',
        previewImg1: require('../images/Projects/db127/db127_01.webp'),
        previewImg2: require('../images/Projects/db127/db127_02.webp'),
        planImg1: require('../images/Projects/db127/db127_11.webp'),
        planImg2: require('../images/Projects/db127/db127_12.webp'),
        previewImg31: require('../images/Projects/db127/db127_31.webp'),
        previewImg32: require('../images/Projects/db127/db127_32.webp'),
        previewImg33: require('../images/Projects/db127/db127_33.webp'),
        previewImg34: require('../images/Projects/db127/db127_34.webp'),
    },
    {
        id: '8',
        title: 'Проект дома ДБ128',
        floor: '1',
        sizes: '',
        square: '69 кв.м',
        balkon: 'нет',
        terrace: 'есть',
        krylco: 'нет',
        erker: 'нет',
        sanuzel: '1',
        bedroom: '2',
        roof: 'вальмовая',
        kukushka: 'нет',
        twoDoor: 'есть',
        garage: '',
        topochnaya: 'нет',
        previewImg1: require('../images/Projects/db128/db128_01.webp'),
        previewImg2: require('../images/Projects/db128/db128_02.webp'),
        planImg1: require('../images/Projects/db128/db128_11.webp'),
        previewImg31: require('../images/Projects/db128/db128_31.webp'),
        previewImg32: require('../images/Projects/db128/db128_32.webp'),
        previewImg33: require('../images/Projects/db128/db128_33.webp'),
        previewImg34: require('../images/Projects/db128/db128_34.webp'),
    },
    {
        id: '9',
        title: 'Проект дома ДБ129',
        floor: '1+М',
        sizes: '',
        square: '63.6 кв.м',
        balkon: 'нет',
        terrace: 'нет',
        krylco: 'есть',
        erker: 'нет',
        sanuzel: '1',
        bedroom: '2',
        roof: 'прямая',
        kukushka: 'есть',
        twoDoor: 'нет',
        garage: '',
        topochnaya: 'нет',
        previewImg1: require('../images/Projects/db129/db129_01.webp'),
        previewImg2: require('../images/Projects/db129/db129_02.webp'),
        planImg1: require('../images/Projects/db129/db129_11.webp'),
        planImg2: require('../images/Projects/db129/db129_12.webp'),
        previewImg31: require('../images/Projects/db129/db129_31.webp'),
        previewImg32: require('../images/Projects/db129/db129_32.webp'),
        previewImg33: require('../images/Projects/db129/db129_33.webp'),
        previewImg34: require('../images/Projects/db129/db129_34.webp'),
    },
    {
        id: '10',
        title: 'Проект дома ДБ135',
        floor: '1+М',
        sizes: '8x6 м',
        square: '69,3 кв.м',
        balkon: 'есть',
        terrace: 'есть',
        krylco: 'нет',
        erker: 'нет',
        sanuzel: '0',
        bedroom: '2',
        roof: 'прямая',
        kukushka: 'нет',
        twoDoor: 'нет',
        garage: '',
        topochnaya: 'нет',
        previewImg1: require('../images/Projects/db135/db135_01.webp'),
        previewImg2: require('../images/Projects/db135/db135_02.webp'),
        planImg1: require('../images/Projects/db135/db135_11.webp'),
        planImg2: require('../images/Projects/db135/db135_12.webp'),
        previewImg31: require('../images/Projects/db135/db135_31.webp'),
        previewImg32: require('../images/Projects/db135/db135_32.webp'),
        previewImg33: require('../images/Projects/db135/db135_33.webp'),
        previewImg34: require('../images/Projects/db135/db135_34.webp'),
    },
    {
        id: '11',
        title: 'Проект дома ДБ174',
        floor: '1,5',
        sizes: '8x8 м',
        square: '96,2 кв.м',
        balkon: 'нет',
        terrace: 'есть',
        krylco: 'нет',
        erker: 'нет',
        sanuzel: '1',
        bedroom: '4',
        roof: 'прямая',
        kukushka: 'нет',
        twoDoor: 'нет',
        garage: '',
        topochnaya: 'нет',
        previewImg1: require('../images/Projects/db174/db174_01.webp'),
        previewImg2: require('../images/Projects/db174/db174_02.webp'),
        planImg1: require('../images/Projects/db174/db174_11.webp'),
        planImg2: require('../images/Projects/db174/db174_12.webp'),
        previewImg31: require('../images/Projects/db174/db174_31.webp'),
        previewImg32: require('../images/Projects/db174/db174_32.webp'),
        previewImg33: require('../images/Projects/db174/db174_33.webp'),
        previewImg34: require('../images/Projects/db174/db174_34.webp'),
    },
    {
        id: '12',
        title: 'Проект дома ДБ181',
        floor: '1,5',
        sizes: '9x7 м',
        square: '107,1 кв.м',
        balkon: 'есть',
        terrace: 'есть',
        krylco: 'нет',
        erker: 'нет',
        sanuzel: '2',
        bedroom: '4',
        roof: 'прямая',
        kukushka: 'нет',
        twoDoor: 'есть',
        garage: '',
        topochnaya: 'нет',
        previewImg1: require('../images/Projects/db181/db181_01.webp'),
        previewImg2: require('../images/Projects/db181/db181_02.webp'),
        planImg1: require('../images/Projects/db181/db181_11.webp'),
        planImg2: require('../images/Projects/db181/db181_12.webp'),
        previewImg31: require('../images/Projects/db181/db181_31.webp'),
        previewImg32: require('../images/Projects/db181/db181_32.webp'),
        previewImg33: require('../images/Projects/db181/db181_33.webp'),
        previewImg34: require('../images/Projects/db181/db181_34.webp'),
    },
    {
        id: '13',
        title: 'Проект дома ДБ188',
        floor: '1,5',
        sizes: '10x8 м',
        square: '141,5 кв.м',
        balkon: 'есть',
        terrace: 'есть',
        krylco: 'есть',
        erker: 'нет',
        sanuzel: '1',
        bedroom: '4',
        roof: 'прямая',
        kukushka: 'нет',
        twoDoor: 'нет',
        garage: '',
        topochnaya: 'нет',
        previewImg1: require('../images/Projects/db188/db188_01.webp'),
        previewImg2: require('../images/Projects/db188/db188_02.webp'),
        planImg1: require('../images/Projects/db188/db188_11.webp'),
        planImg2: require('../images/Projects/db188/db188_12.webp'),
        previewImg31: require('../images/Projects/db188/db188_31.webp'),
        previewImg32: require('../images/Projects/db188/db188_32.webp'),
        previewImg33: require('../images/Projects/db188/db188_33.webp'),
        previewImg34: require('../images/Projects/db188/db188_34.webp'),
    },
    {
        id: '14',
        title: 'Проект дома ДБ212',
        floor: '1',
        sizes: '15x8 м',
        square: '115,9 кв.м',
        balkon: 'нет',
        terrace: 'есть',
        krylco: 'есть',
        erker: 'нет',
        sanuzel: '1',
        bedroom: '3',
        roof: 'прямая',
        kukushka: 'нет',
        twoDoor: 'нет',
        garage: '',
        topochnaya: 'нет',
        previewImg1: require('../images/Projects/db212/db212_01.webp'),
        previewImg2: require('../images/Projects/db212/db212_02.webp'),
        planImg1: require('../images/Projects/db212/db212_11.webp'),
        previewImg31: require('../images/Projects/db212/db212_31.webp'),
        previewImg32: require('../images/Projects/db212/db212_32.webp'),
        previewImg33: require('../images/Projects/db212/db212_33.webp'),
        previewImg34: require('../images/Projects/db212/db212_34.webp'),
    },
]

function Project() {
    const params = useParams()
    const newDoma = doma.find(elem => elem.id === params.id)
    return (
      <>
        <div className="Project">
            <div className="custom__container">
                <div className="Page_navigation">Главная / Проекты / {newDoma.title}</div>
                <div className="main_block">
                    <div className="top_leftContent">
                        <img src={newDoma.previewImg1} alt="previewImg" />
                    </div>
                    <div className="top_rightContent">
                        <div className="left">
                            <div className="name">Дом в тёплый угол</div>
                            <div className="title">{newDoma.title}</div>
                            <div className="specs">
                                <ul>
                                    <li><b>Размер:</b> {newDoma.sizes}</li>
                                    <li><b>Общая площадь:</b> {newDoma.square}</li>
                                    <li><b>Полезная площадь:</b> {newDoma.sizes}</li>
                                    <li><b>Кол-во спален:</b> {newDoma.bedroom}</li>
                                    <li><b>Кол-во санузлов:</b> {newDoma.sanuzel}</li>
                                    <li><b>Этажей:</b> {newDoma.floor}</li>
                                </ul>
                            </div>
                            <div className="shema">Схема работы</div>
                        </div>
                        <div className="right">
                            <div className="profilirovan">
                                <div className="subtitle">Профилированный брус</div>
                                <div className="point">
                                    <div className="point_left">
                                    <svg width="56" height="56" viewBox="0 0 56 56" fill="none" xmlns="http://www.w3.org/2000/svg">
<path d="M0.984751 21.3283C4.16475 8.25593 15.1717 0.0421145 28.0045 0.000145796C40.8374 -0.0411347 52.0434 8.68763 55.1612 21.153C58.2791 33.619 52.5044 46.6064 41.1666 52.6264C29.8294 58.6472 16.2549 56.5976 7.29737 46.5693C0.532177 38.9954 -1.41695 31.2013 0.984751 21.3283ZM29.2949 2.54922V6.89126C37.398 7.3419 44.5181 12.4233 47.5872 19.9466L45.3094 20.8839C42.384 13.7458 35.3719 9.14638 27.6686 9.31287C19.9647 9.47869 13.1574 14.376 10.541 21.6339C7.92473 28.8917 10.0395 37.0137 15.8616 42.0692L14.2469 43.9314C11.882 41.8749 10.0038 39.3164 8.7485 36.4426L4.73806 38.0626C5.36053 39.5019 6.11418 40.8801 6.98949 42.1804L7.01151 42.2121C7.22312 42.5252 7.44232 42.8333 7.66836 43.1367L7.74662 43.2414C14.8274 52.6891 27.4701 56.0148 38.2734 51.2717C49.0767 46.5292 55.2012 34.9653 53.0603 23.3483C50.9194 11.7319 41.0772 3.11889 29.2949 2.54922ZM3.01913 23.6545C2.96554 23.9717 2.9188 24.2888 2.87895 24.6059C2.86933 24.6761 2.86036 24.7469 2.85143 24.8205C2.81502 25.1102 2.78346 25.3993 2.75735 25.6883C2.74429 25.8341 2.73394 25.9813 2.72295 26.1278C2.70646 26.3521 2.68922 26.5763 2.67892 26.8006C2.66105 27.1879 2.64951 27.5754 2.64951 27.969C2.64951 28.3777 2.66106 28.7835 2.68029 29.1881C2.6851 29.2892 2.69269 29.3904 2.69887 29.4915C2.71742 29.8101 2.74087 30.1258 2.76904 30.4423C2.77729 30.5297 2.78677 30.617 2.7957 30.7044C2.83418 31.067 2.87954 31.4276 2.93657 31.7854C2.94069 31.8129 2.94414 31.8412 2.94826 31.8687C3.15232 33.1863 3.46085 34.485 3.86965 35.7537L7.89505 34.1281C6.00015 27.934 7.05279 21.2106 10.7492 15.8936C14.4462 10.5767 20.377 7.2552 26.836 6.88437V2.54922C14.9458 3.14228 5.0535 11.9088 3.01913 23.6545ZM46.6961 27.9697C46.6913 34.7583 43.0079 41.0082 37.0758 44.2941L35.1061 40.3482C39.5521 37.8163 42.3009 33.0919 42.3078 27.9697H39.8453C39.8522 32.0778 37.7217 35.8926 34.2226 38.0365C30.7234 40.1803 26.3619 40.3436 22.7122 38.4674L25.1451 34.6324C27.8535 35.8213 31.0112 35.2479 33.1307 33.1832C35.2503 31.1178 35.9085 27.9725 34.7955 25.2287C33.6824 22.4856 31.0201 20.691 28.063 20.6904V23.1564C29.1156 23.1578 30.1379 23.5066 30.972 24.1492L28.3982 26.1471L29.9077 28.0961L32.4869 26.094C33.3396 28.1154 32.7192 30.4589 30.9782 31.7909C29.2365 33.1236 26.816 33.1077 25.0921 31.7523C23.3683 30.3976 22.7788 28.0458 23.6582 26.0362L21.4068 25.0441C20.1687 27.8656 20.8448 31.1627 23.0921 33.268L20.6455 37.125C16.7677 33.9815 15.2899 28.7325 16.9567 24.0238C18.6235 19.315 23.0729 16.1695 28.0616 16.173V13.7073C23.1952 13.7121 18.6688 16.2061 16.0601 20.3197L13.9968 19.3104L12.9161 21.5271L14.9106 22.5019C12.7278 27.7157 13.834 33.7282 17.7276 37.8212C21.6218 41.9141 27.5662 43.3108 32.8717 41.3795L34.8485 45.3426C32.6877 46.193 30.3867 46.6292 28.0651 46.6286V49.0943C34.3194 49.0943 40.2501 46.3106 44.2508 41.4966L46.6933 43.1808L48.0894 41.1491L45.7162 39.5146C47.9656 36.0855 49.1618 32.0723 49.1584 27.9697H46.6961ZM41.2017 22.4513C40.4961 20.7663 39.4722 19.2332 38.1867 17.9363L36.4362 19.6707C37.4997 20.7433 38.347 22.0109 38.9317 23.4048L41.2017 22.4513Z" fill="#CC6B0B"/>
                                    </svg>
                                    </div>
                                    <div className="point_right">
                                        <div className="text"><b>Сечение:</b> 140х140</div>
                                        <div className="price">от 5 530 200 руб.</div>
                                    </div>
                                </div>
                                <div className="point">
                                    <div className="point_left">
                                    <svg width="56" height="56" viewBox="0 0 56 56" fill="none" xmlns="http://www.w3.org/2000/svg">
<path d="M0.984751 21.3283C4.16475 8.25593 15.1717 0.0421145 28.0045 0.000145796C40.8374 -0.0411347 52.0434 8.68763 55.1612 21.153C58.2791 33.619 52.5044 46.6064 41.1666 52.6264C29.8294 58.6472 16.2549 56.5976 7.29737 46.5693C0.532177 38.9954 -1.41695 31.2013 0.984751 21.3283ZM29.2949 2.54922V6.89126C37.398 7.3419 44.5181 12.4233 47.5872 19.9466L45.3094 20.8839C42.384 13.7458 35.3719 9.14638 27.6686 9.31287C19.9647 9.47869 13.1574 14.376 10.541 21.6339C7.92473 28.8917 10.0395 37.0137 15.8616 42.0692L14.2469 43.9314C11.882 41.8749 10.0038 39.3164 8.7485 36.4426L4.73806 38.0626C5.36053 39.5019 6.11418 40.8801 6.98949 42.1804L7.01151 42.2121C7.22312 42.5252 7.44232 42.8333 7.66836 43.1367L7.74662 43.2414C14.8274 52.6891 27.4701 56.0148 38.2734 51.2717C49.0767 46.5292 55.2012 34.9653 53.0603 23.3483C50.9194 11.7319 41.0772 3.11889 29.2949 2.54922ZM3.01913 23.6545C2.96554 23.9717 2.9188 24.2888 2.87895 24.6059C2.86933 24.6761 2.86036 24.7469 2.85143 24.8205C2.81502 25.1102 2.78346 25.3993 2.75735 25.6883C2.74429 25.8341 2.73394 25.9813 2.72295 26.1278C2.70646 26.3521 2.68922 26.5763 2.67892 26.8006C2.66105 27.1879 2.64951 27.5754 2.64951 27.969C2.64951 28.3777 2.66106 28.7835 2.68029 29.1881C2.6851 29.2892 2.69269 29.3904 2.69887 29.4915C2.71742 29.8101 2.74087 30.1258 2.76904 30.4423C2.77729 30.5297 2.78677 30.617 2.7957 30.7044C2.83418 31.067 2.87954 31.4276 2.93657 31.7854C2.94069 31.8129 2.94414 31.8412 2.94826 31.8687C3.15232 33.1863 3.46085 34.485 3.86965 35.7537L7.89505 34.1281C6.00015 27.934 7.05279 21.2106 10.7492 15.8936C14.4462 10.5767 20.377 7.2552 26.836 6.88437V2.54922C14.9458 3.14228 5.0535 11.9088 3.01913 23.6545ZM46.6961 27.9697C46.6913 34.7583 43.0079 41.0082 37.0758 44.2941L35.1061 40.3482C39.5521 37.8163 42.3009 33.0919 42.3078 27.9697H39.8453C39.8522 32.0778 37.7217 35.8926 34.2226 38.0365C30.7234 40.1803 26.3619 40.3436 22.7122 38.4674L25.1451 34.6324C27.8535 35.8213 31.0112 35.2479 33.1307 33.1832C35.2503 31.1178 35.9085 27.9725 34.7955 25.2287C33.6824 22.4856 31.0201 20.691 28.063 20.6904V23.1564C29.1156 23.1578 30.1379 23.5066 30.972 24.1492L28.3982 26.1471L29.9077 28.0961L32.4869 26.094C33.3396 28.1154 32.7192 30.4589 30.9782 31.7909C29.2365 33.1236 26.816 33.1077 25.0921 31.7523C23.3683 30.3976 22.7788 28.0458 23.6582 26.0362L21.4068 25.0441C20.1687 27.8656 20.8448 31.1627 23.0921 33.268L20.6455 37.125C16.7677 33.9815 15.2899 28.7325 16.9567 24.0238C18.6235 19.315 23.0729 16.1695 28.0616 16.173V13.7073C23.1952 13.7121 18.6688 16.2061 16.0601 20.3197L13.9968 19.3104L12.9161 21.5271L14.9106 22.5019C12.7278 27.7157 13.834 33.7282 17.7276 37.8212C21.6218 41.9141 27.5662 43.3108 32.8717 41.3795L34.8485 45.3426C32.6877 46.193 30.3867 46.6292 28.0651 46.6286V49.0943C34.3194 49.0943 40.2501 46.3106 44.2508 41.4966L46.6933 43.1808L48.0894 41.1491L45.7162 39.5146C47.9656 36.0855 49.1618 32.0723 49.1584 27.9697H46.6961ZM41.2017 22.4513C40.4961 20.7663 39.4722 19.2332 38.1867 17.9363L36.4362 19.6707C37.4997 20.7433 38.347 22.0109 38.9317 23.4048L41.2017 22.4513Z" fill="#CC6B0B"/>
                                    </svg>
                                    </div>
                                    <div className="point_right">
                                        <div className="text"><b>Сечение:</b> 140х190</div>
                                        <div className="price">от 5 530 200 руб.</div>
                                    </div>
                                </div>
                            </div>
                            <div className="nestrogan">
                                <div className="subtitle">Нестрограный брус</div>
                                <div className="point">
                                    <div className="point_left">
                                    <svg width="56" height="56" viewBox="0 0 56 56" fill="none" xmlns="http://www.w3.org/2000/svg">
<path d="M0.984751 21.3283C4.16475 8.25593 15.1717 0.0421145 28.0045 0.000145796C40.8374 -0.0411347 52.0434 8.68763 55.1612 21.153C58.2791 33.619 52.5044 46.6064 41.1666 52.6264C29.8294 58.6472 16.2549 56.5976 7.29737 46.5693C0.532177 38.9954 -1.41695 31.2013 0.984751 21.3283ZM29.2949 2.54922V6.89126C37.398 7.3419 44.5181 12.4233 47.5872 19.9466L45.3094 20.8839C42.384 13.7458 35.3719 9.14638 27.6686 9.31287C19.9647 9.47869 13.1574 14.376 10.541 21.6339C7.92473 28.8917 10.0395 37.0137 15.8616 42.0692L14.2469 43.9314C11.882 41.8749 10.0038 39.3164 8.7485 36.4426L4.73806 38.0626C5.36053 39.5019 6.11418 40.8801 6.98949 42.1804L7.01151 42.2121C7.22312 42.5252 7.44232 42.8333 7.66836 43.1367L7.74662 43.2414C14.8274 52.6891 27.4701 56.0148 38.2734 51.2717C49.0767 46.5292 55.2012 34.9653 53.0603 23.3483C50.9194 11.7319 41.0772 3.11889 29.2949 2.54922ZM3.01913 23.6545C2.96554 23.9717 2.9188 24.2888 2.87895 24.6059C2.86933 24.6761 2.86036 24.7469 2.85143 24.8205C2.81502 25.1102 2.78346 25.3993 2.75735 25.6883C2.74429 25.8341 2.73394 25.9813 2.72295 26.1278C2.70646 26.3521 2.68922 26.5763 2.67892 26.8006C2.66105 27.1879 2.64951 27.5754 2.64951 27.969C2.64951 28.3777 2.66106 28.7835 2.68029 29.1881C2.6851 29.2892 2.69269 29.3904 2.69887 29.4915C2.71742 29.8101 2.74087 30.1258 2.76904 30.4423C2.77729 30.5297 2.78677 30.617 2.7957 30.7044C2.83418 31.067 2.87954 31.4276 2.93657 31.7854C2.94069 31.8129 2.94414 31.8412 2.94826 31.8687C3.15232 33.1863 3.46085 34.485 3.86965 35.7537L7.89505 34.1281C6.00015 27.934 7.05279 21.2106 10.7492 15.8936C14.4462 10.5767 20.377 7.2552 26.836 6.88437V2.54922C14.9458 3.14228 5.0535 11.9088 3.01913 23.6545ZM46.6961 27.9697C46.6913 34.7583 43.0079 41.0082 37.0758 44.2941L35.1061 40.3482C39.5521 37.8163 42.3009 33.0919 42.3078 27.9697H39.8453C39.8522 32.0778 37.7217 35.8926 34.2226 38.0365C30.7234 40.1803 26.3619 40.3436 22.7122 38.4674L25.1451 34.6324C27.8535 35.8213 31.0112 35.2479 33.1307 33.1832C35.2503 31.1178 35.9085 27.9725 34.7955 25.2287C33.6824 22.4856 31.0201 20.691 28.063 20.6904V23.1564C29.1156 23.1578 30.1379 23.5066 30.972 24.1492L28.3982 26.1471L29.9077 28.0961L32.4869 26.094C33.3396 28.1154 32.7192 30.4589 30.9782 31.7909C29.2365 33.1236 26.816 33.1077 25.0921 31.7523C23.3683 30.3976 22.7788 28.0458 23.6582 26.0362L21.4068 25.0441C20.1687 27.8656 20.8448 31.1627 23.0921 33.268L20.6455 37.125C16.7677 33.9815 15.2899 28.7325 16.9567 24.0238C18.6235 19.315 23.0729 16.1695 28.0616 16.173V13.7073C23.1952 13.7121 18.6688 16.2061 16.0601 20.3197L13.9968 19.3104L12.9161 21.5271L14.9106 22.5019C12.7278 27.7157 13.834 33.7282 17.7276 37.8212C21.6218 41.9141 27.5662 43.3108 32.8717 41.3795L34.8485 45.3426C32.6877 46.193 30.3867 46.6292 28.0651 46.6286V49.0943C34.3194 49.0943 40.2501 46.3106 44.2508 41.4966L46.6933 43.1808L48.0894 41.1491L45.7162 39.5146C47.9656 36.0855 49.1618 32.0723 49.1584 27.9697H46.6961ZM41.2017 22.4513C40.4961 20.7663 39.4722 19.2332 38.1867 17.9363L36.4362 19.6707C37.4997 20.7433 38.347 22.0109 38.9317 23.4048L41.2017 22.4513Z" fill="#CC6B0B"/>
                                    </svg>
                                    </div>
                                    <div className="point_right">
                                        <div className="text"><b>Сечение:</b> 150х150</div>
                                        <div className="price">от 200 руб.</div>
                                    </div>
                                </div>
                            </div>
                            <div className="vhodit">Что входит в стоимость</div>
                            <div className="buttons">
                                <div className="main__button">Зафиксировать стоимость</div>
                                <div className="main__button">Заявка на кредит онлайн</div>
                            </div>
                        </div>
                    </div>
                </div>
                <div className="tabs_block">
                <Tabs defaultActiveKey="home" id="uncontrolled-tab-example" className="mb-3">
                    <Tab eventKey="home" title="Планировка">
                        <div className="plan_content">
                            <div className="item"><img src={newDoma.planImg1} alt="plan1" /></div>
                            <div className="item"><img src={newDoma.planImg2} alt="plan2" /></div>
                            <div className="third_block item">
                                <div className="text">Если Вы хотите сделать изменения в этом проекте, то заполните форму заявки, напишите комментарии и мы свяжемся с Вами.</div>
                                <div className="main__button">Хочу такой дом</div>
                            </div>
                        </div>
                    </Tab>
                    <Tab eventKey="profile" title="Фасады">
                        <div className="profile_fasad">
                            <img src={newDoma.previewImg31} alt="fasad1" />
                            <img src={newDoma.previewImg32} alt="fasad2" />
                            <img src={newDoma.previewImg33} alt="fasad3" />
                            <img src={newDoma.previewImg34} alt="fasad4" />
                        </div>
                    </Tab>
                    <Tab eventKey="contact" title="О проекте">
                        Test
                    </Tab>
                </Tabs>
                </div>
                <div className="table_block">
                <Table striped bordered hover>
                    <thead>
                        <tr>
                        <th className="profile140">
                            <div className="item">
                            <div className="left_th">
                            <svg width="56" height="56" viewBox="0 0 56 56" fill="none" xmlns="http://www.w3.org/2000/svg">
<path d="M0.984751 21.3283C4.16475 8.25593 15.1717 0.0421145 28.0045 0.000145796C40.8374 -0.0411347 52.0434 8.68763 55.1612 21.153C58.2791 33.619 52.5044 46.6064 41.1666 52.6264C29.8294 58.6472 16.2549 56.5976 7.29737 46.5693C0.532177 38.9954 -1.41695 31.2013 0.984751 21.3283ZM29.2949 2.54922V6.89126C37.398 7.3419 44.5181 12.4233 47.5872 19.9466L45.3094 20.8839C42.384 13.7458 35.3719 9.14638 27.6686 9.31287C19.9647 9.47869 13.1574 14.376 10.541 21.6339C7.92473 28.8917 10.0395 37.0137 15.8616 42.0692L14.2469 43.9314C11.882 41.8749 10.0038 39.3164 8.7485 36.4426L4.73806 38.0626C5.36053 39.5019 6.11418 40.8801 6.98949 42.1804L7.01151 42.2121C7.22312 42.5252 7.44232 42.8333 7.66836 43.1367L7.74662 43.2414C14.8274 52.6891 27.4701 56.0148 38.2734 51.2717C49.0767 46.5292 55.2012 34.9653 53.0603 23.3483C50.9194 11.7319 41.0772 3.11889 29.2949 2.54922ZM3.01913 23.6545C2.96554 23.9717 2.9188 24.2888 2.87895 24.6059C2.86933 24.6761 2.86036 24.7469 2.85143 24.8205C2.81502 25.1102 2.78346 25.3993 2.75735 25.6883C2.74429 25.8341 2.73394 25.9813 2.72295 26.1278C2.70646 26.3521 2.68922 26.5763 2.67892 26.8006C2.66105 27.1879 2.64951 27.5754 2.64951 27.969C2.64951 28.3777 2.66106 28.7835 2.68029 29.1881C2.6851 29.2892 2.69269 29.3904 2.69887 29.4915C2.71742 29.8101 2.74087 30.1258 2.76904 30.4423C2.77729 30.5297 2.78677 30.617 2.7957 30.7044C2.83418 31.067 2.87954 31.4276 2.93657 31.7854C2.94069 31.8129 2.94414 31.8412 2.94826 31.8687C3.15232 33.1863 3.46085 34.485 3.86965 35.7537L7.89505 34.1281C6.00015 27.934 7.05279 21.2106 10.7492 15.8936C14.4462 10.5767 20.377 7.2552 26.836 6.88437V2.54922C14.9458 3.14228 5.0535 11.9088 3.01913 23.6545ZM46.6961 27.9697C46.6913 34.7583 43.0079 41.0082 37.0758 44.2941L35.1061 40.3482C39.5521 37.8163 42.3009 33.0919 42.3078 27.9697H39.8453C39.8522 32.0778 37.7217 35.8926 34.2226 38.0365C30.7234 40.1803 26.3619 40.3436 22.7122 38.4674L25.1451 34.6324C27.8535 35.8213 31.0112 35.2479 33.1307 33.1832C35.2503 31.1178 35.9085 27.9725 34.7955 25.2287C33.6824 22.4856 31.0201 20.691 28.063 20.6904V23.1564C29.1156 23.1578 30.1379 23.5066 30.972 24.1492L28.3982 26.1471L29.9077 28.0961L32.4869 26.094C33.3396 28.1154 32.7192 30.4589 30.9782 31.7909C29.2365 33.1236 26.816 33.1077 25.0921 31.7523C23.3683 30.3976 22.7788 28.0458 23.6582 26.0362L21.4068 25.0441C20.1687 27.8656 20.8448 31.1627 23.0921 33.268L20.6455 37.125C16.7677 33.9815 15.2899 28.7325 16.9567 24.0238C18.6235 19.315 23.0729 16.1695 28.0616 16.173V13.7073C23.1952 13.7121 18.6688 16.2061 16.0601 20.3197L13.9968 19.3104L12.9161 21.5271L14.9106 22.5019C12.7278 27.7157 13.834 33.7282 17.7276 37.8212C21.6218 41.9141 27.5662 43.3108 32.8717 41.3795L34.8485 45.3426C32.6877 46.193 30.3867 46.6292 28.0651 46.6286V49.0943C34.3194 49.0943 40.2501 46.3106 44.2508 41.4966L46.6933 43.1808L48.0894 41.1491L45.7162 39.5146C47.9656 36.0855 49.1618 32.0723 49.1584 27.9697H46.6961ZM41.2017 22.4513C40.4961 20.7663 39.4722 19.2332 38.1867 17.9363L36.4362 19.6707C37.4997 20.7433 38.347 22.0109 38.9317 23.4048L41.2017 22.4513Z" fill="#FFFFFF"/>
                            </svg>
                                Профилированный брус
                            </div>
                            <div className="right_th">
                                140х140
                            </div>
                            </div>
                        </th>
                        <th className="profile190">
                            <div className="item">
                            <div className="left_th">
                            <svg width="56" height="56" viewBox="0 0 56 56" fill="none" xmlns="http://www.w3.org/2000/svg">
<path d="M0.984751 21.3283C4.16475 8.25593 15.1717 0.0421145 28.0045 0.000145796C40.8374 -0.0411347 52.0434 8.68763 55.1612 21.153C58.2791 33.619 52.5044 46.6064 41.1666 52.6264C29.8294 58.6472 16.2549 56.5976 7.29737 46.5693C0.532177 38.9954 -1.41695 31.2013 0.984751 21.3283ZM29.2949 2.54922V6.89126C37.398 7.3419 44.5181 12.4233 47.5872 19.9466L45.3094 20.8839C42.384 13.7458 35.3719 9.14638 27.6686 9.31287C19.9647 9.47869 13.1574 14.376 10.541 21.6339C7.92473 28.8917 10.0395 37.0137 15.8616 42.0692L14.2469 43.9314C11.882 41.8749 10.0038 39.3164 8.7485 36.4426L4.73806 38.0626C5.36053 39.5019 6.11418 40.8801 6.98949 42.1804L7.01151 42.2121C7.22312 42.5252 7.44232 42.8333 7.66836 43.1367L7.74662 43.2414C14.8274 52.6891 27.4701 56.0148 38.2734 51.2717C49.0767 46.5292 55.2012 34.9653 53.0603 23.3483C50.9194 11.7319 41.0772 3.11889 29.2949 2.54922ZM3.01913 23.6545C2.96554 23.9717 2.9188 24.2888 2.87895 24.6059C2.86933 24.6761 2.86036 24.7469 2.85143 24.8205C2.81502 25.1102 2.78346 25.3993 2.75735 25.6883C2.74429 25.8341 2.73394 25.9813 2.72295 26.1278C2.70646 26.3521 2.68922 26.5763 2.67892 26.8006C2.66105 27.1879 2.64951 27.5754 2.64951 27.969C2.64951 28.3777 2.66106 28.7835 2.68029 29.1881C2.6851 29.2892 2.69269 29.3904 2.69887 29.4915C2.71742 29.8101 2.74087 30.1258 2.76904 30.4423C2.77729 30.5297 2.78677 30.617 2.7957 30.7044C2.83418 31.067 2.87954 31.4276 2.93657 31.7854C2.94069 31.8129 2.94414 31.8412 2.94826 31.8687C3.15232 33.1863 3.46085 34.485 3.86965 35.7537L7.89505 34.1281C6.00015 27.934 7.05279 21.2106 10.7492 15.8936C14.4462 10.5767 20.377 7.2552 26.836 6.88437V2.54922C14.9458 3.14228 5.0535 11.9088 3.01913 23.6545ZM46.6961 27.9697C46.6913 34.7583 43.0079 41.0082 37.0758 44.2941L35.1061 40.3482C39.5521 37.8163 42.3009 33.0919 42.3078 27.9697H39.8453C39.8522 32.0778 37.7217 35.8926 34.2226 38.0365C30.7234 40.1803 26.3619 40.3436 22.7122 38.4674L25.1451 34.6324C27.8535 35.8213 31.0112 35.2479 33.1307 33.1832C35.2503 31.1178 35.9085 27.9725 34.7955 25.2287C33.6824 22.4856 31.0201 20.691 28.063 20.6904V23.1564C29.1156 23.1578 30.1379 23.5066 30.972 24.1492L28.3982 26.1471L29.9077 28.0961L32.4869 26.094C33.3396 28.1154 32.7192 30.4589 30.9782 31.7909C29.2365 33.1236 26.816 33.1077 25.0921 31.7523C23.3683 30.3976 22.7788 28.0458 23.6582 26.0362L21.4068 25.0441C20.1687 27.8656 20.8448 31.1627 23.0921 33.268L20.6455 37.125C16.7677 33.9815 15.2899 28.7325 16.9567 24.0238C18.6235 19.315 23.0729 16.1695 28.0616 16.173V13.7073C23.1952 13.7121 18.6688 16.2061 16.0601 20.3197L13.9968 19.3104L12.9161 21.5271L14.9106 22.5019C12.7278 27.7157 13.834 33.7282 17.7276 37.8212C21.6218 41.9141 27.5662 43.3108 32.8717 41.3795L34.8485 45.3426C32.6877 46.193 30.3867 46.6292 28.0651 46.6286V49.0943C34.3194 49.0943 40.2501 46.3106 44.2508 41.4966L46.6933 43.1808L48.0894 41.1491L45.7162 39.5146C47.9656 36.0855 49.1618 32.0723 49.1584 27.9697H46.6961ZM41.2017 22.4513C40.4961 20.7663 39.4722 19.2332 38.1867 17.9363L36.4362 19.6707C37.4997 20.7433 38.347 22.0109 38.9317 23.4048L41.2017 22.4513Z" fill="#FFFFFF"/>
                            </svg>
                                Профилированный брус
                            </div>
                            <div className="right_th">
                                140х190
                            </div>
                            </div>
                        </th>
                        <th className="profile150">
                            <div className="item">
                            <div className="left_th">
                            <svg width="56" height="56" viewBox="0 0 56 56" fill="none" xmlns="http://www.w3.org/2000/svg">
<path d="M0.984751 21.3283C4.16475 8.25593 15.1717 0.0421145 28.0045 0.000145796C40.8374 -0.0411347 52.0434 8.68763 55.1612 21.153C58.2791 33.619 52.5044 46.6064 41.1666 52.6264C29.8294 58.6472 16.2549 56.5976 7.29737 46.5693C0.532177 38.9954 -1.41695 31.2013 0.984751 21.3283ZM29.2949 2.54922V6.89126C37.398 7.3419 44.5181 12.4233 47.5872 19.9466L45.3094 20.8839C42.384 13.7458 35.3719 9.14638 27.6686 9.31287C19.9647 9.47869 13.1574 14.376 10.541 21.6339C7.92473 28.8917 10.0395 37.0137 15.8616 42.0692L14.2469 43.9314C11.882 41.8749 10.0038 39.3164 8.7485 36.4426L4.73806 38.0626C5.36053 39.5019 6.11418 40.8801 6.98949 42.1804L7.01151 42.2121C7.22312 42.5252 7.44232 42.8333 7.66836 43.1367L7.74662 43.2414C14.8274 52.6891 27.4701 56.0148 38.2734 51.2717C49.0767 46.5292 55.2012 34.9653 53.0603 23.3483C50.9194 11.7319 41.0772 3.11889 29.2949 2.54922ZM3.01913 23.6545C2.96554 23.9717 2.9188 24.2888 2.87895 24.6059C2.86933 24.6761 2.86036 24.7469 2.85143 24.8205C2.81502 25.1102 2.78346 25.3993 2.75735 25.6883C2.74429 25.8341 2.73394 25.9813 2.72295 26.1278C2.70646 26.3521 2.68922 26.5763 2.67892 26.8006C2.66105 27.1879 2.64951 27.5754 2.64951 27.969C2.64951 28.3777 2.66106 28.7835 2.68029 29.1881C2.6851 29.2892 2.69269 29.3904 2.69887 29.4915C2.71742 29.8101 2.74087 30.1258 2.76904 30.4423C2.77729 30.5297 2.78677 30.617 2.7957 30.7044C2.83418 31.067 2.87954 31.4276 2.93657 31.7854C2.94069 31.8129 2.94414 31.8412 2.94826 31.8687C3.15232 33.1863 3.46085 34.485 3.86965 35.7537L7.89505 34.1281C6.00015 27.934 7.05279 21.2106 10.7492 15.8936C14.4462 10.5767 20.377 7.2552 26.836 6.88437V2.54922C14.9458 3.14228 5.0535 11.9088 3.01913 23.6545ZM46.6961 27.9697C46.6913 34.7583 43.0079 41.0082 37.0758 44.2941L35.1061 40.3482C39.5521 37.8163 42.3009 33.0919 42.3078 27.9697H39.8453C39.8522 32.0778 37.7217 35.8926 34.2226 38.0365C30.7234 40.1803 26.3619 40.3436 22.7122 38.4674L25.1451 34.6324C27.8535 35.8213 31.0112 35.2479 33.1307 33.1832C35.2503 31.1178 35.9085 27.9725 34.7955 25.2287C33.6824 22.4856 31.0201 20.691 28.063 20.6904V23.1564C29.1156 23.1578 30.1379 23.5066 30.972 24.1492L28.3982 26.1471L29.9077 28.0961L32.4869 26.094C33.3396 28.1154 32.7192 30.4589 30.9782 31.7909C29.2365 33.1236 26.816 33.1077 25.0921 31.7523C23.3683 30.3976 22.7788 28.0458 23.6582 26.0362L21.4068 25.0441C20.1687 27.8656 20.8448 31.1627 23.0921 33.268L20.6455 37.125C16.7677 33.9815 15.2899 28.7325 16.9567 24.0238C18.6235 19.315 23.0729 16.1695 28.0616 16.173V13.7073C23.1952 13.7121 18.6688 16.2061 16.0601 20.3197L13.9968 19.3104L12.9161 21.5271L14.9106 22.5019C12.7278 27.7157 13.834 33.7282 17.7276 37.8212C21.6218 41.9141 27.5662 43.3108 32.8717 41.3795L34.8485 45.3426C32.6877 46.193 30.3867 46.6292 28.0651 46.6286V49.0943C34.3194 49.0943 40.2501 46.3106 44.2508 41.4966L46.6933 43.1808L48.0894 41.1491L45.7162 39.5146C47.9656 36.0855 49.1618 32.0723 49.1584 27.9697H46.6961ZM41.2017 22.4513C40.4961 20.7663 39.4722 19.2332 38.1867 17.9363L36.4362 19.6707C37.4997 20.7433 38.347 22.0109 38.9317 23.4048L41.2017 22.4513Z" fill="#FFFFFF"/>
                            </svg>
                                Нестрограный брус
                            </div>
                            <div className="right_th">
                                150х150
                            </div>
                            </div>
                        </th>
                        </tr>
                    </thead>
                    <tbody>
                        <tr>
                        <td>Состав комплектации</td>
                        <td>Состав комплектации</td>
                        <td>Состав комплектации</td>
                        </tr>
                        <tr>
                        <td>Состав комплектации</td>
                        <td>Состав комплектации</td>
                        <td>Состав комплектации</td>
                        </tr>
                        <tr>
                        <td>Состав комплектации</td>
                        <td>Состав комплектации</td>
                        <td>Состав комплектации</td>
                        </tr>
                        <tr>
                        <td>Состав комплектации</td>
                        <td>Состав комплектации</td>
                        <td>Состав комплектации</td>
                        </tr>
                        <tr>
                        <td>Состав комплектации</td>
                        <td>Состав комплектации</td>
                        <td>Состав комплектации</td>
                        </tr>
                        <tr>
                        <td>Состав комплектации</td>
                        <td>Состав комплектации</td>
                        <td>Состав комплектации</td>
                        </tr>
                        <tr>
                        <td>Состав комплектации</td>
                        <td>Состав комплектации</td>
                        <td>Состав комплектации</td>
                        </tr>
                    </tbody>
                </Table>
                </div>
                <div className="dop_uslugi">
                    <div className="Page_title">Дополнительные услуги</div>
                    <div className="accordion_title">Фундамент</div>
                    <Accordion defaultActiveKey="0">
                        <Accordion.Item eventKey="0">
                            <Accordion.Header>Состав комплектации</Accordion.Header>
                            <Accordion.Body>
                            Lorem ipsum dolor sit amet, consectetur adipiscing elit, sed do eiusmod
                            </Accordion.Body>
                        </Accordion.Item>
                        <Accordion.Item eventKey="1">
                            <Accordion.Header>Состав комплектации</Accordion.Header>
                            <Accordion.Body>
                            Lorem ipsum dolor sit amet, consectetur adipiscing elit, sed do eiusmod
                            </Accordion.Body>
                        </Accordion.Item>
                        <Accordion.Item eventKey="2">
                            <Accordion.Header>Состав комплектации</Accordion.Header>
                            <Accordion.Body>
                            Lorem ipsum dolor sit amet, consectetur adipiscing elit, sed do eiusmod
                            </Accordion.Body>
                        </Accordion.Item>
                        <Accordion.Item eventKey="3">
                            <Accordion.Header>
                                <div className="accordion_header">
                                    <div className="title">Ленточный мелкозаглубленный фундамент</div>
                                    <div className="price">1 980 200 руб.</div>
                                </div>
                            </Accordion.Header>
                            <Accordion.Body>
                                <div className="accordion_body">
                                    <div className="subtitle">В стоимость фундамента входит:</div>
                                    <ul>
                                        <CustomLi text="Стройматериалы"/>
                                        <CustomLi text="Доставка по Московской области (для других регионов уточняйте у наших менеджеров)"/>
                                        <CustomLi text="Монтаж"/>
                                    </ul>
                                    <p>Цена указана для ровного участка. Если на пятне застройки присутствую перепад, то производится перерасчет стоимости фундамента.</p>
                                    <p> В случае отсутствия подъезда к фундаменту с 3-х сторон, заливка бетона производится бетононасосом. Работу бетононасоса оплачивает заказчик.22.</p>
                                </div>
                            </Accordion.Body>
                        </Accordion.Item>
                    </Accordion>
                    <div className="accordion_title">Кровля крыши</div>
                    <Accordion defaultActiveKey="0">
                        <Accordion.Item eventKey="0">
                            <Accordion.Header>Состав комплектации</Accordion.Header>
                            <Accordion.Body>
                            Lorem ipsum dolor sit amet, consectetur adipiscing elit, sed do eiusmod
                            </Accordion.Body>
                        </Accordion.Item>
                        <Accordion.Item eventKey="1">
                            <Accordion.Header>
                                <div className="accordion_header">
                                    <div className="title">Металлочерепица Grand Line</div>
                                    <div className="price">1 980 200 руб.</div>
                                </div>
                            </Accordion.Header>
                            <Accordion.Body>
                                <div className="accordion_body">
                                    <div className="subtitle">В стоимость фундамента входит:</div>
                                    <ul>
                                        <CustomLi text="Стройматериалы"/>
                                        <CustomLi text="Доставка по Московской области (для других регионов уточняйте у наших менеджеров)"/>
                                        <CustomLi text="Монтаж"/>
                                    </ul>
                                    <p>Цена указана для ровного участка. Если на пятне застройки присутствую перепад, то производится перерасчет стоимости фундамента.</p>
                                    <p> В случае отсутствия подъезда к фундаменту с 3-х сторон, заливка бетона производится бетононасосом. Работу бетононасоса оплачивает заказчик.22.</p>
                                </div>
                            </Accordion.Body>
                        </Accordion.Item>
                    </Accordion>
                </div>
            </div>

            <FirstBlockOptions/>
            <div className="custom__container catalog_block">
                <div className="Page_title">Посмотрите другие проекты домов в тёплый угол</div>
                <div className="catalog__cards">
                {doma.slice(+newDoma.id, +newDoma.id + 3).map((res) =>
                    <Cards key={res.id} id={window.location.pathname.replace(newDoma.id, res.id)} title={res.title} sizes={res.sizes} square={res.square} previewImg={res.previewImg1}/>
                )}

                </div>
            </div>

            <HowWork/>
            <Free/>
        </div>
      </>
    );
  }
  
  export default Project;